In [2]:
import numpy as np
import pandas as pd

In [3]:
dict = {
    "name": ["sohan", "raj", "rajesh", "mukesh", "anita", "deepak", "priya", "karan"],
    "markd": [95, 35, 63, 85, 78, 92, 56, 88],
    "city": ["Indore", "Bhopal", "Ujjain", "Agra", "Delhi", "Pune", "Jaipur", "Surat"],
}

In [4]:
df = pd.DataFrame(dict)

In [5]:
df

     name  markd    city
0   sohan     95  Indore
1     raj     35  Bhopal
2  rajesh     63  Ujjain
3  mukesh     85    Agra
4   anita     78   Delhi
5  deepak     92    Pune
6   priya     56  Jaipur
7   karan     88   Surat

In [6]:
# df.to_csv('friends.csv', index=False)

In [7]:
df.head(2)

    name  markd    city
0  sohan     95  Indore
1    raj     35  Bhopal

In [8]:
df.tail(2)

    name  markd    city
6  priya     56  Jaipur
7  karan     88   Surat

In [9]:
df.tail()

     name  markd    city
3  mukesh     85    Agra
4   anita     78   Delhi
5  deepak     92    Pune
6   priya     56  Jaipur
7   karan     88   Surat

In [10]:
df.describe()

           markd
count   8.000000
mean   74.000000
std    20.921622
min    35.000000
25%    61.250000
50%    81.500000
75%    89.000000
max    95.000000

In [11]:
file = pd.read_csv("myfile.csv")

In [12]:
file['speed']

0    100.0
1     35.0
2     63.0
3     85.0
4     69.0
5     68.8
6     68.6
7     68.4
8     68.2
9     68.0
Name: speed, dtype: float64

In [13]:
file['speed'][0]=100

C:\Users\Admin\AppData\Local\Temp\ipykernel_980\1028782362.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  file['speed'][0]=100

In [14]:
# file.to_csv("myfile.csv",index=False)

In [15]:
# ser = pd.Series(np.random.rand(34))

In [16]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))
newdf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 334 entries, 0 to 333
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       334 non-null    float64
 1   1       334 non-null    float64
 2   2       334 non-null    float64
 3   3       334 non-null    float64
 4   4       334 non-null    float64
dtypes: float64(5)
memory usage: 15.7 KB

In [17]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [18]:
newdf.size

1670

In [19]:
newdf.shape

(334, 5)

In [20]:
newdf.ndim

2

In [22]:
newdf.unique

AttributeError: 'DataFrame' object has no attribute 'unique'